{
	"bot": {
		"owners": ["<user ID>", "<second user ID>"],//User IDs that should get access to bot owner commands
		"prefix": ["schwi."],//the bots prefix
		"status": "online",//the status the bot should use, can be "online", "idle", "dnd" (do not disturb) or "invisible".
		"activityType": "listening",//the activity type the bot should use, can be "PLAYING", "WATCHING", "LISTENING" or "STREAMING".
		"activityName": "schwi.help",//the activity name the bot should use.
		"activityURL": "",//---currently unused due to issues with it--- the stream URL in case the "STREAMING" activity type is used. Can only be Twitch or YouTube links.
		"embedColor": ""//default embed color - if empty it uses the color of it's role
	},
    "permissions": {//available permissions are listed here: https://discordpy.readthedocs.io/en/latest/api.html#discord.Permissions
    	"scanFeeds": "send_messages",//permission to scan feeds (schwi.scan)
    	"editFeeds": "manage_channels"//permission to add/edit/remove feeds
    },
	"rss": {
		"interval": 30,//the interval in which the bot checks for new articles - time is in minutes - must be at least 10 -- requires a restart
		"scanDelay": 1000,//delay between feed scans - time is in milliseconds
		"postDelay": 500,//delay between feed posts - time is in milliseconds
        "combinePosts": 1,//If there are more posts than this from a single feed then all subsequent posts will get combined into one (if there are 3 new posts and this is set to 1 then the first will get posted normally, the rest gets combined into a "...and 2 more posts" - set to 0 to disable)
        "oldestFirst": true,//posts the oldest items first
        "dateFormat": "%a %d %b %Y at %I:%M%p",//the date format that's used, formatted using pythons time.strftime() function (see https://docs.python.org/2/library/time.html#time.strftime)
        "duplicatePreventionAmount": 10//The amount of posts that should be remembered to prevent duplicate posts (simply remembers title, nothing else)
	},
    "RPC": {
        "autoRestart": true,//whether Schwi should automatically restart when starting rich presence (since it can only be changed at startup)
        "interval": 5,//the interval in which the bot updates the Rich Presence - time is in minutes - must be at least 1 -- requires a restart
        "displayStartTime": true,//Displays the start time, starts when schwi.startrpc is used (time can be reset using schwi.resetrpctime)
        "RetroAchievements": {//settings only used for the RetroAchievements rich presences
            "displayGameName": false,//whether the game name should be displayed (the game name can always be displayed by hovering over the cover art if one is used)
            "displayAchievementsGotten": true,//whether it should get the amount of achievemnts gotten (displays before the Game Name - ignores whether they've been gotten with Hardcore or not)
            "displaySmallImage": true,//displays a small image with the name 'ra' - intended to be the RetroAchievements logo
            "smallImageText": "RetroAchievements"//the text that gets displayed when hovering over the small image
        }
    },
	"log": {
		"level": "info",//what level should be output, can be one of the following: "debug" > "spamInfo" > "info"  > "warn" > "silent" -- "spamInfo" is basically the same as "info" except a lot more spammy at times, will post every single feed being parsed along other things
		"discordLogOutput": false,//if logs should be output to discord as well (note: will not output spamInfo and below)
		"discordLogChannel": "<channel ID>",//the channel the logs should be posted to
		"discordLogLevelOverwrite": "",//overwrites the log level for discord logs - will not accept spamInfo and below - leave empty if normal log level should be used.
        "logTimeOnDiscord": false,//if the time should be included in the discord logs
		"logFileMaxLines": 200//max numbers of lines allowed in the log.txt file - note: read/writing is not optimized so huge files could take a while to read/write to
	},
	"fixed": { //do not change anything in here - this is only for the bot itself
		"configJSONVersion": 1
	}
}